---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotChangeTypeOfOldCurtainPanel
source: html/0659b026-5672-768a-4798-1e2913d148b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotChangeTypeOfOldCurtainPanel Property

Cannot change the type of curtain panels in walls created with early versions of Revit. To change the panels of this curtain wall, wall must be recreated.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeTypeOfOldCurtainPanel { get; }
```